{"id":"tian2024","title":"The Impact of Upward Social Comparison on Social Media on Appearance Anxiety: A Moderated Mediation Model","authors":"Tian, J., Li, B., Zhang, R.","journal":"Behavioral Sciences","year":"2024","doi":"10.3390/behavsci-15-00008","url":"https://www.mdpi.com/2076-328X/15/1/8","keyAssumptions":"Previous research assumed general social comparison effects without examining specific mediating mechanisms or protective factors","keyHypotheses":"Self-objectification mediates USC-appearance anxiety relationship; self-compassion moderates this pathway","strengths":"Large sample (n=397); validated measures; clear mediation model; identifies both risk and protective factors","weaknesses":"Cross-sectional design; limited cultural generalizability; focus on young adults rather than adolescents","citation":"Tian, J., Li, B., & Zhang, R. (2024). The Impact of Upward Social Comparison on Social Media on Appearance Anxiety: A Moderated Mediation Model. Behavioral Sciences, 15(1), 8.","notes":"Key finding: USC significantly predicts appearance anxiety (β = 0.546, p < 0.001); self-objectification mediates 21% of total effect","addedDate":"2025-08-19T23:01:45.000Z"}
{"id":"choukas2022","title":"The Perfect Storm: A Developmental–Sociocultural Framework for the Role of Social Media in Adolescent Girls' Body Image Concerns and Mental Health","authors":"Choukas-Bradley, S., Nesi, J., et al.","journal":"Clinical Child and Family Psychology Review","year":"2022","doi":"10.1007/s10567-022-00404-5","url":"https://link.springer.com/article/10.1007/s10567-022-00404-5","keyAssumptions":"Previous research treated social media effects as gender-neutral or focused only on screen time","keyHypotheses":"Social media features intersect with developmental and sociocultural factors to create 'perfect storm' for girls' body image concerns","strengths":"Comprehensive theoretical framework; strong literature synthesis; gender-specific approach; identifies body image as key mediator","weaknesses":"Theoretical rather than empirical; limited examination of protective factors; focus primarily on girls","citation":"Choukas-Bradley, S., et al. (2022). The Perfect Storm: A Developmental–Sociocultural Framework for the Role of Social Media in Adolescent Girls' Body Image Concerns and Mental Health. Clinical Child and Family Psychology Review, 25, 681-701.","notes":"Establishes that SM features (idealized images, quantifiable feedback) intersect with developmental factors and gender socialization","addedDate":"2025-08-19T23:01:45.000Z"}
{"id":"abdoli2025","title":"Body Image and Self-Esteem in Indian and Italian University Students: Cross-Cultural Insights for Psychiatric Well-Being","authors":"Abdoli, M., Nayak, O., Fadia, A., Rairikar, M., De Sousa, A., Cotrufo, P.","journal":"Psychiatry International","year":"2025","doi":"10.3390/psychiatryint-06-00040","url":"https://www.mdpi.com/2673-5318/6/2/40","keyAssumptions":"Western-derived body image measures and concepts assumed universally applicable across cultures","keyHypotheses":"Cultural contexts shape body image and self-esteem as psychological constructs affecting mental health","strengths":"Large cross-cultural sample (n=767); standardized measures; clear cultural differences identified; clinical relevance","weaknesses":"Limited to two countries; university student sample; cross-sectional design","citation":"Abdoli, M., et al. (2025). Body Image and Self-Esteem in Indian and Italian University Students: Cross-Cultural Insights for Psychiatric Well-Being. Psychiatry International, 6(2), 40.","notes":"Indian students showed higher self-esteem and more positive body image; cultural values provide protective effects","addedDate":"2025-08-19T23:01:45.000Z"}
{"id":"tirona2023","title":"The Impact of Colonial Beauty Standards on the Ethnic Identity and Mental Health of Filipina Americans","authors":"Tirona, C.M.G.","journal":"San Francisco State University Thesis","year":"2023","doi":"N/A","url":"https://scholarworks.calstate.edu/downloads/z890s1602","keyAssumptions":"Beauty standards research often treated ethnic minorities as monolithic without examining colonial histories","keyHypotheses":"Colonial Eurocentric beauty standards affect ethnic identity formation and mental health through intergenerational transmission","strengths":"Qualitative phenomenological approach; narrative analysis; identifies specific themes; addresses understudied population","weaknesses":"Small sample (n=14); limited generalizability; thesis rather than peer-reviewed publication","citation":"Tirona, C.M.G. (2023). The Impact of Colonial Beauty Standards on the Ethnic Identity and Mental Health of Filipina Americans. Master's thesis, San Francisco State University.","notes":"Six themes identified including media overrepresentation, familial reinforcement, mental health impacts, and ethnic identity complications","addedDate":"2025-08-19T23:01:45.000Z"}
{"id":"zhou2024","title":"Comparing the Impact of Screen Time Modes on Body Image for Men and Women","authors":"Zhou, N.","journal":"Research Archive of Rising Scholars","year":"2024","doi":"10.58445/rars.1436","url":"https://research-archive.org/index.php/rars/preprint/view/1436","keyAssumptions":"Prior research assumed uniform effects of screen time across genders and activities","keyHypotheses":"Different screen time activities have differential effects on body image by gender","strengths":"Platform-specific analysis; gender comparison; literature review approach","weaknesses":"Preprint status; limited original data; high school student author","citation":"Zhou, N. (2024). Comparing the Impact of Screen Time Modes on Body Image for Men and Women. Research Archive of Rising Scholars, 1436.","notes":"Social media negative for both genders; TV viewing affects women only; gaming shows no significant correlation","addedDate":"2025-08-19T23:01:45.000Z"}
{"id":"kumari2024","title":"Impact of Korean Wave on Eating Disorders: A Comparative Study","authors":"Kumari, A.","journal":"International Journal of Indian Psychology","year":"2024","doi":"10.25215/1201.133","url":"https://ijip.in/articles/korean-wave-on-eating-disorders/","keyAssumptions":"Pop culture influences assumed primarily Western; East Asian beauty standards' global impact understudied","keyHypotheses":"Korean Wave popularity influences eating behaviors and body image ideals internationally","strengths":"Novel cultural focus; comparative design; uses validated eating disorder measure (EDE-Q 6.0)","weaknesses":"Small sample (n=100); limited demographic diversity; cross-sectional design","citation":"Kumari, A. (2024). Impact of Korean Wave on Eating Disorders: A Comparative Study. International Journal of Indian Psychology, 12(1), 133.","notes":"Korean Wave followers scored significantly higher on eating disorder scales than non-followers","addedDate":"2025-08-19T23:01:45.000Z"}
{"id":"croatian2023","title":"Effects of Social Media Social Comparisons and Identity Processes on Body Image Satisfaction in Late Adolescence","authors":"Croatian research team","journal":"PMC","year":"2023","doi":"PMC10508212","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC10508212/","keyAssumptions":"Prior work treated body image as unidimensional; didn't examine identity development interactions","keyHypotheses":"Identity development interacts with social media comparison to affect body image domains differently","strengths":"Domain-specific body image analysis; identity development focus; late adolescent sample (n=354)","weaknesses":"Single country sample; cross-sectional design; limited generalizability","citation":"Croatian research team (2023). Effects of Social Media Social Comparisons and Identity Processes on Body Image Satisfaction in Late Adolescence. PMC, Article 10508212.","notes":"Different body image domains show distinct patterns; identity commitment more important for attribution, social comparison crucial for appearance/weight","addedDate":"2025-08-19T23:01:45.000Z"}